Q1. List any five functions of the pandas library with execution.

In [46]:
import pandas  as pd

mydataset={
'cars':['BMW','TOYOTA','LEXUS','MERCEDES','HYUNDAI','MORRIS GARAGE'],
'price':['60L','20L','70L','80L','15L','25L']   
}


df=pd.DataFrame(mydataset)

print (df)

            cars price
0            BMW   60L
1         TOYOTA   20L
2          LEXUS   70L
3       MERCEDES   80L
4        HYUNDAI   15L
5  MORRIS GARAGE   25L

In [8]:
df.head()

       cars price
0       BMW   60L
1    TOYOTA   20L
2     LEXUS   70L
3  MERCEDES   80L
4   HYUNDAI   15L

In [9]:
df.head(2)

     cars price
0     BMW   60L
1  TOYOTA   20L

In [10]:
df.tail()

            cars price
1         TOYOTA   20L
2          LEXUS   70L
3       MERCEDES   80L
4        HYUNDAI   15L
5  MORRIS GARAGE   25L

In [11]:
df.tail(3)

            cars price
3       MERCEDES   80L
4        HYUNDAI   15L
5  MORRIS GARAGE   25L

In [12]:
df.to_string()

'            cars price\n0            BMW   60L\n1         TOYOTA   20L\n2          LEXUS   70L\n3       MERCEDES   80L\n4        HYUNDAI   15L\n5  MORRIS GARAGE   25L'

In [13]:
df.describe()

       cars price
count     6     6
unique    6     6
top     BMW   60L
freq      1     1

In [15]:
type(df)

pandas.core.frame.DataFrame

In [18]:
df.dtypes

cars     object
price    object
dtype: object

In [21]:
df['cars']

0              BMW
1           TOYOTA
2            LEXUS
3         MERCEDES
4          HYUNDAI
5    MORRIS GARAGE
Name: cars, dtype: object

In [24]:
df['price']

0    60L
1    20L
2    70L
3    80L
4    15L
5    25L
Name: price, dtype: object

In [29]:
len(df)

6

In [32]:
df=pd.Series(mydataset)

In [33]:
df

cars     [BMW, TOYOTA, LEXUS, MERCEDES, HYUNDAI, MORRIS...
price                       [60L, 20L, 70L, 80L, 15L, 25L]
dtype: object

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [48]:
df=pd.DataFrame(mydataset , index=['A','B','C','D','E','F'])

In [49]:
df

            cars price
A            BMW   60L
B         TOYOTA   20L
C          LEXUS   70L
D       MERCEDES   80L
E        HYUNDAI   15L
F  MORRIS GARAGE   25L

In [60]:
def reindex_with_incrementing_index(df):
    
    new_index = pd.Series(range(1, 2 * len(df), 2))
    df.index = new_index
    return df

In [61]:
df_new = reindex_with_incrementing_index(df)
print(df_new)

             cars price
1             BMW   60L
3          TOYOTA   20L
5           LEXUS   70L
7        MERCEDES   80L
9         HYUNDAI   15L
11  MORRIS GARAGE   25L

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [62]:
data={
'food':['burger','pizza','fries','coffee'],
'values':[100,400,200,100]    
}

df=pd.DataFrame(data)

In [64]:
df

     food  values
0  burger     100
1   pizza     400
2   fries     200
3  coffee     100

In [89]:
def sum_of_fisrt_three_values(df):
    
    values=df['values'].head(3).sum()
    return values

In [90]:
resad=sum_of_fisrt_three_values(df)
print(resad)

700

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [117]:
import pandas as pd
data = {'Text': ['Hey I am Reshad', 'Nice t meet you', 'have fun']}
df = pd.DataFrame(data)
def calculate_word_count(text):
    words = text.split()
    return len(words)
df['Word_Count'] = df['Text'].apply(calculate_word_count)
print(df)

              Text  Word_Count
0  Hey I am Reshad           4
1  Nice t meet you           4
2         have fun           2

Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.shape returns a tuple representing the dimensions (rows, columns) of the DataFrame.
DataFrame.size returns an integer representing the total number of elements in the DataFrame.

Q6. Which function of pandas do we use to read an excel file?

you can use the read_excel() function to read data from an Excel file into a Pandas dataframe

pd.read_excel()

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [2]:
import pandas as pd
data_set={'Email':['rexx03@gmail.com','ad123@gmail.com','reshad89@gmail.com']}

df=pd.DataFrame(data_set)

In [3]:
df

                Email
0    rexx03@gmail.com
1     ad123@gmail.com
2  reshad89@gmail.com

In [7]:
def user_name(Email):
    useername=Email.split('@')
    return (useername[0])

df['new_col']=df['Email'].apply(user_name)

print (df)

                Email   new_col
0    rexx03@gmail.com    rexx03
1     ad123@gmail.com     ad123
2  reshad89@gmail.com  reshad89

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

In [5]:
data__set={
'A':[3,8,6,2,9],
'B':[5,2,9,3,1],
'c':[1,7,4,5,2]   
}

import pandas as pd
df=pd.DataFrame(data__set)

In [6]:
df

   A  B  c
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [7]:
def select_rows(df):
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]
    return selected_rows
selected_df = select_rows(df)
print(selected_df)

   A  B  c
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [8]:
data_set={
'values':[2,3,5,6,34,9,8,]
}

df = pd.DataFrame(data_set)

In [9]:
df

   values
0       2
1       3
2       5
3       6
4      34
5       9
6       8

In [51]:
def mean_med_sd(values):
    x=df['values'].mean()
    y=df['values'].median()
    z=df['values'].std()
    
    return x,y,z

In [52]:
df['mean_med_std']=df['values'].apply(mean_med_sd)

In [55]:
df

,values,"(mean, median, st.dv)",mean_med_std
0,2,"(9.571428571428571, 6.0)","(9.571428571428571, 6.0, 11.058287131636359)"
1,3,"(9.571428571428571, 6.0)","(9.571428571428571, 6.0, 11.058287131636359)"
2,5,"(9.571428571428571, 6.0)","(9.571428571428571, 6.0, 11.058287131636359)"
3,6,"(9.571428571428571, 6.0)","(9.571428571428571, 6.0, 11.058287131636359)"
4,34,"(9.571428571428571, 6.0)","(9.571428571428571, 6.0, 11.058287131636359)"
5,9,"(9.571428571428571, 6.0)","(9.571428571428571, 6.0, 11.058287131636359)"
6,8,"(9.571428571428571, 6.0)","(9.571428571428571, 6.0, 11.058287131636359)"

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [71]:
data={
'Sales':[10000,50000,60000,25000,34000],
'Date':[21,22,23,24,25]   
}

df=pd.DataFrame(data)

In [72]:
def add_moving_average(df):

    df = df.sort_values('Date').reset_index(drop=True)
    
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    
    return df
df = add_moving_average(df)

print(df)

   Sales  Date  MovingAverage
0  10000    21        10000.0
1  50000    22        30000.0
2  60000    23        40000.0
3  25000    24        36250.0
4  34000    25        35800.0

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [20]:
import pandas as pd
date_data={
'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']
}

df=pd.DataFrame(date_data)

In [21]:
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [41]:
def weekday_(df):
    
    df['Date']=pd.to_datetime(df['Date'])
    
    df['Weekday'] = df['Date'].dt.strftime('%A')
    
    return df

In [42]:
e=weekday_(df)

In [43]:
e

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [45]:
import pandas as pd

def select_rows_between_dates(df, date_column_name, start_date, end_date):
   
    df[date_column_name] = pd.to_datetime(df[date_column_name])
    
   
    mask = (df[date_column_name] >= start_date) & (df[date_column_name] <= end_date)
    filtered_df = df.loc[mask]
    
    return filtered_df

In [46]:
data = {
    'Date': ['2023-01-15', '2023-01-20', '2023-02-05', '2023-01-25', '2023-01-10']
}
df = pd.DataFrame(data)

filtered_df = select_rows_between_dates(df, 'Date', '2023-01-01', '2023-01-31')

print(filtered_df)

        Date
0 2023-01-15
1 2023-01-20
3 2023-01-25
4 2023-01-10